<template>
  <modal name='modal-policy' transition="pop-out" :height="'auto'" width="100%" :maxWidth="1170" :maxHeight="680"  :adaptive="true"
         :scrollable="true" @before-open="disableSrollFp" @before-close="activeSrollFp">
    <div class="modal b-modal-policy">
      <div class="close-modal" @click="$modal.hide('modal-policy')" title="Закрыть">×</div>
      <h2 class="title">Политика конфиденциальности</h2>
      <div class="wrapper-text" id="textPolicy">
        <h3 class="title-section">1. Общие положения</h3>
        <p class="paragraph">Настоящая Политика применима только к Сервисам ООО «Сноб Медиа». ООО «Сноб Медиа» не контролирует и не несет ответственность за сайты третьих лиц, на которые пользователь может перейти по ссылкам, доступным на сайтах ООО «Сноб Медиа». На таких сайтах у пользователя может собираться или запрашиваться иная персональная информация, а также могут совершаться иные действия.</p>
        <p class="paragraph">ООО «Сноб Медиа»в общем случае не проверяет достоверность персональной информации, предоставляемой пользователями, и не осуществляет контроль за их дееспособностью. Однако ООО «Сноб Медиа» исходит из того, что пользователь предоставляет достоверную и достаточную персональную информацию по вопросам, предлагаемым в форме регистрации, что указанные им при регистрации персональные данные принадлежат лично ему и поддерживает эту информацию в актуальном состоянии. Риск предоставления недостоверной информации несет предоставивший ее пользователь.</p>
        <p class="paragraph">Согласие пользователя на обработку персональных данных действует бессрочно с момента осуществления регистрации пользователя на сайте, и не требует периодического подтверждения. ООО «Сноб Медиа» будет хранить персональную информацию столько времени, сколько это необходимо для достижения цели, для которой она была собрана, или для соблюдения требований законодательства и нормативных актов.</p>
        <h3 class="title-section">2. Цели сбора и обработки персональной информации пользователей</h3>
        <p class="paragraph">ООО «Сноб Медиа» собирает, обрабатывает и хранит только те персональные данные, которые необходимы для предоставления Сервисов и оказания услуг (исполнения соглашений и договоров с пользователем), в строгом соответствии с действующим законодательством.</p>
        <p class="paragraph">Персональную информацию пользователя ООО «Сноб Медиа» может использовать в следующих целях:</p>
        <ul class="list">
          <li>Идентификация стороны в рамках соглашений и договоров с ООО «Сноб Медиа»;</li>
          <li>Обработка необходима для выполнения договорных обязательств ООО «Сноб Медиа» перед пользователем;</li>
          <li>Связь с пользователем, в том числе направление уведомлений, запросов и информации, касающихся использования Сервисов, оказания услуг, а также обработка запросов и заявок от пользователя;</li>
        </ul>
        <h3 class="title-section">3. Условия обработки персональной информации пользователя и ее передачи третьим лицам</h3>
        <p class="paragraph">В отношении персональной информации пользователя сохраняется ее конфиденциальность, кроме случаев добровольного предоставления пользователем информации о себе для общего доступа неограниченному кругу лиц. При использовании отдельных Сервисов (например, блога), пользователь соглашается с тем, что определенная часть его персональной информации становится общедоступной.</p>
        <p class="paragraph">ООО «Сноб Медиа» вправе передать персональную информацию пользователя третьим лицам в следующих случаях:</p>
        <ul class="list">
          <li>Пользователь выразил свое согласие на такие действия;</li>
          <li>Передача необходима в рамках использования пользователем определенного Сервиса либо для оказания услуги пользователю;</li>
          <li>Передача предусмотрена российским или иным применимым законодательством в рамках установленной законодательством процедуры;</li>
          <li>Такая передача происходит в рамках продажи или иной передачи бизнеса (полностью или в части), при этом к приобретателю переходят все обязательства по соблюдению условий настоящей Политики применительно к полученной им персональной информации;</li>
        </ul>
        <h3 class="title-section">4. Обратная связь. Вопросы и предложения</h3>
        <p class="paragraph">Все предложения или вопросы по поводу настоящей Политики следует сообщать в Службу поддержки пользователей, либо по адресу 119072, город Москва, а/я 36, для ООО «Сноб Медиа».</p>
      </div>
    </div>
  </modal>
</template>

<script>
  export default {
    name: "ModalPolicy",
    methods:{
      disableSrollFp() {
        fullpage_api.setAllowScrolling(false);
      },
      activeSrollFp () {
        fullpage_api.setAllowScrolling(true);
      }
    }
  }
</script>

<style scoped>

</style>
